snlkuharlocal/src/Documents/ПроверкаПоставкиМаркированногоТовара/ПроверкаПоставкиМаркированногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроверкаПоставкиМаркированногоТовара</name>
  <basedOn>Document.ЛистНабора</basedOn>
  <attributes>
    <name>НоменклатураОсновная</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаводское</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеверныхШтучныхКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеправильногоСодержимогоКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтклонениеОтЗаводскогоКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПолныйКороб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛинейныхШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстQR</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>85</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПроверкаПоставкиМаркированногоТовара/Forms/ФормаДокумента/Module.bsl
#Область СтандартныеФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.НачалоСканирования = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Параметры.Свойство("ШтрихкодУпаковки") Тогда
		Если ЗначениеЗаполнено(Параметры.ШтрихкодУпаковки) И Параметры.ШтрихкодУпаковки.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
			Объект.КодАгрегации = Параметры.ШтрихкодУпаковки;
			//++Данилова Е.В. 05.05.2026 SNL-219 
			ЛистПоКоду = Документы.ПроверкаПоставкиМаркированногоТовара.НайтиЛистПоКодуАгрегации(Объект.КодАгрегации);
			Если ЗначениеЗаполнено(ЛистПоКоду) Тогда
				
				Объект.ДокОснование = ЛистПоКоду; 
				ЗаполнитьНаСервере(ЛистПоКоду); 
				
			КонецЕсли;
			//--Данилова Е.В. 05.05.2026 
		КонецЕсли;
	КонецЕсли;

	УправлениеВидимостью();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПереключитьРежимСканирования("");
	         
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИмитацияСканирования = "";
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.КоличествоЗаводское.ТолькоПросмотр = ?(Объект.НеПолныйКороб, Ложь, Истина);
	
	ИменаПолей = СтрРазделить("Товары,ШтрихкодыУпаковок,СоставБригады,Сканировщик,НоменклатураОсновная,КодАгрегации", ",");
	
	Для Каждого ИмяЭУ Из ИменаПолей Цикл
		Элементы[ИмяЭУ].ТолькоПросмотр = ЗначениеЗаполнено(Объект.ОкончаниеСканирования);	
	КонецЦикла;
	
	ИменаКнопок = СтрРазделить("ПроверитьКоробку", ","); // "СброситьРежимСканирования" оставляем, вдруг придется скинуть Данные
	
	Для Каждого ИмяЭУ Из ИменаКнопок Цикл
		Элементы[ИмяЭУ].Доступность = НЕ ЗначениеЗаполнено(Объект.ОкончаниеСканирования);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВнешниеСобытия

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда
		Сообщить("Внешнее событие не является событием сканера ШК");
		Возврат;
	КонецЕсли;
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	Длина_ШтрихКода = СтрДлина(Данные);
	
	/////////////////// ЛЕГПРОМ ////////////////////////////////////////////////////
	// 2 символа - 01,
	// 14 символов — GTIN, международный код продукции,
	// 2 символа - 21,
	// 13 символов + 1 — Серийный номер + <GS>,
	// 2 символа — 91,
	// 4 символа + 1 - ИД ключа проверки + <GS>,
	// 2 символа — 92,
	// 88 символов - Код проверки.
	// ИТОГО ЗНАЧИМЫХ: 2 + 14 + 2 + 13 = 31 символ
	////////////////////////////////////////////////////////////////////////////////
	ЗначимыеСимволыМаркировки = 31;
		
	////////////////////////////////////////////////////////////////////////////////
	// В начале Кода агрегации добавлены 2 "нуля" - исторически!
	////////////////////////////////////////////////////////////////////////////////
	ОтрезаемСимволы = 3; // "00"
	
	Объект.РежимСканирования = ПроверитьСоответствиеРежимаСканирования(Данные);
	
	ПереключитьРежимСканирования(Объект.РежимСканирования);
	
	////////////////////////////////////////////////////////////////////////////////
	// Это только для режима подключения сканера ШК "в разрыв клавиатуры"
	////////////////////////////////////////////////////////////////////////////////
	Если Событие <> "ПолученШтрихкод" Тогда
		Данные = ЗаполнениеДокументов.ИзменитьРаскладкуТекстаEN_RU(Данные, Ложь);
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////////
	
	Если Объект.РежимСканирования = "ОбычныйШК" Тогда
		
		СтруктураВозврата = Документы.ПроверкаПоставкиМаркированногоТовара.ПолучитьСтруктуруВозврата(Данные,
			Документы.ПроверкаПоставкиМаркированногоТовара.ТекстЗапроса_НайтиНоменклатуруПоОсновномуШК());
		
		Если СтруктураВозврата.Успех Тогда
			
			Если Объект.Товары.Количество() = 0 Тогда
				
				Объект.НоменклатураОсновная = СтруктураВозврата.Номенклатура;
				Объект.КоличествоЗаводское = СтруктураВозврата.ДополнительныйПараметр; 
				
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.Номенклатура = СтруктураВозврата.Номенклатура;
				НоваяСтрока.Количество = 1;
				
				Если НЕ ЗначениеЗаполнено(Объект.КоличествоЗаводское) Тогда
					Сообщить("Заводское количество по ШК " + Данные + " равно 0. Установите признак <Не полный короб>");
				КонецЕсли;
				
			Иначе
				Если СтруктураВозврата.Номенклатура <> Объект.Товары.Получить(0).Номенклатура тогда
					Сообщить("В этой коробке уже есть другая Номенклатура. Двух позиций в коробке быть не может!");
					Объект.ЕстьОшибки = Истина;
					Данные = "";
					Возврат;
				Иначе
					ПерваяСтрока = Объект.Товары.Получить(0);
					ПерваяСтрока.Количество = ПерваяСтрока.Количество + 1;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			Если НЕ ЗначениеЗаполнено(СтруктураВозврата.Номенклатура) Тогда
				Сообщить("Не найдена Номенклатура по ШК " + Данные);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтруктураВозврата.ДополнительныйПараметр) Тогда
				Сообщить("Заводское количество по ШК " + Данные + " равно 0");
				Если НЕ Объект.НеПолныйКороб Тогда
					Сообщить("Установите признак <Не полный короб> для корректировки Заводского количества");
				КонецЕсли;
			КонецЕсли;
			Объект.ЕстьОшибки = Истина;
			Данные = "";
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Объект.РежимСканирования = "ШтукаЧЗ" Тогда
		
		Если ЗаполнениеДокументов.НайтиНедопустимыеСимволыКодаМаркировки(Лев(Данные,31)) Тогда
			Сообщить("Обнаружены недопустимые символы Кода маркировки");
			Возврат;
		КонецЕсли;
			
		СтруктураВозврата = Документы.ПроверкаПоставкиМаркированногоТовара.ПолучитьСтруктуруВозврата(
			Лев(Данные, ЗначимыеСимволыМаркировки),
			Документы.ПроверкаПоставкиМаркированногоТовара.ТекстЗапроса_НайтиНоменклатуруШтукаЧЗ());
			
		Если СтруктураВозврата.Успех Тогда
			
			НайденныеСтроки = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("Номенклатура, ШтрихкодУпаковки",
				СтруктураВозврата.Номенклатура, СтруктураВозврата.ДополнительныйПараметр));
			
			Если НайденныеСтроки.Количество() = 0 Тогда
			
				НоваяСтрока = Объект.ШтрихкодыУпаковок.Добавить();
				НоваяСтрока.Номенклатура = СтруктураВозврата.Номенклатура;
				НоваяСтрока.ШтрихкодУпаковки = СтруктураВозврата.ДополнительныйПараметр;
				НоваяСтрока.ТекстQR = Лев(Данные, ЗначимыеСимволыМаркировки);
				
			Иначе
				Сообщить("Это дубль Кода маркировки " + Лев(Данные, ЗначимыеСимволыМаркировки));
				Возврат;
			КонецЕсли;
			
		Иначе
			Если НЕ ЗначениеЗаполнено(СтруктураВозврата.Номенклатура) Тогда
				Сообщить("Не найдена Номенклатура по Коду маркировки штуки <Честный Знак> " + Данные);
			КонецЕсли;
			Объект.ЕстьОшибки = Истина;
			Данные = "";
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Объект.РежимСканирования = "КоробЧЗ" Тогда
			
		СтруктураВозврата = Документы.ПроверкаПоставкиМаркированногоТовара.ПолучитьСтруктуруВозврата(   
			Сред(Данные, ОтрезаемСимволы, Длина_ШтрихКода - ОтрезаемСимволы + 1),
			Документы.ПроверкаПоставкиМаркированногоТовара.ТекстЗапроса_НайтиНоменклатуруКоробЧЗ());
			
		Объект.КодАгрегации = СтруктураВозврата.ДополнительныйПараметр;
		//++Данилова Е.В. 05.05.2026 SNL-219 
		ЛистПоКоду = Документы.ПроверкаПоставкиМаркированногоТовара.НайтиЛистПоКодуАгрегации(Объект.КодАгрегации);
		Если ЗначениеЗаполнено(ЛистПоКоду) Тогда
			
			Объект.ДокОснование = ЛистПоКоду; 	
			//Кухарь А.Ю.  12.05.2026 начало
			// SNL-219                       
			ДокОснованиеПриИзменении(Неопределено);
			//Кухарь А.Ю.  12.05.2026 конец
		
	
			
		КонецЕсли;
		//--Данилова Е.В. 05.05.2026
		
		Объект.НоменклатураОсновная = СтруктураВозврата.Номенклатура;
		
		// Шворобей ВЮ 26.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5306 
		//Объект.КоличествоЗаводское = СтруктураВозврата.ДополнительныйПараметр.Количество;
		Объект.КоличествоЗаводское = ЗначениеРеквизитаОбъекта(Объект.КодАгрегации, "Количество");
		
		СтруктураАгрегации = Документы.ПроверкаПоставкиМаркированногоТовара.НайтиКоличествоЗаводское(Объект.КодАгрегации);
		
		Если Объект.КоличествоЗаводское = 0 Тогда
			Объект.КоличествоЗаводское = СтруктураАгрегации.КоличествоЗаводское;
		КонецЕсли;
		
		Для Каждого СтруктураСтроки ИЗ СтруктураАгрегации.МассивНоменклатуры Цикл
		
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтруктураСтроки.Номенклатура));
		
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), СтруктураСтроки);
			КонецЕсли;
		
		КонецЦикла;
		// Шворобей ВЮ 26.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5306
		
		Если НЕ СтруктураВозврата.Успех Тогда
			Если НЕ ЗначениеЗаполнено(Объект.КодАгрегации) Тогда
				Сообщить("Не найден Код агрегации по ШК коробки " + Данные);
				Объект.ЕстьОшибки = Истина;
				Данные = "";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.РежимСканирования = "ФизЛица" Тогда
		
		ФизЛицо = Справочники.ФизическиеЛица.НайтиПоРеквизиту("Штрихкод", Данные);
		
		Если ЗначениеЗаполнено(ФизЛицо) Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.Сканировщик) И Объект.СоставБригады.Количество() = 0 Тогда
				Объект.Сканировщик = ФизЛицо;
			КонецЕсли;
			
			НайденныеСтроки = Объект.СоставБригады.НайтиСтроки(Новый Структура("Сотрудник", ФизЛицо));
		
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Объект.СоставБригады.Добавить();
				НоваяСтрока.Сотрудник = ФизЛицо;
				Если ЗначениеЗаполнено(Объект.НачалоСканирования) Тогда
					НоваяСтрока.ДатаНачала = Объект.НачалоСканирования;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзменении

&НаКлиенте
Процедура НоменклатураОсновнаяПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.НоменклатураОсновная) Тогда
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Объект.НоменклатураОсновная));
		
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Объект.НоменклатураОсновная;
			НоваяСтрока.Количество = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	ВнешнееСобытие(Неопределено,"BarCodeValue", ЭтаФорма.ИмитацияСканирования);
	ИмитацияСканирования = "";
КонецПроцедуры

&НаКлиенте
Процедура НеПолныйКоробПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область КомандыЛокальные

&НаКлиенте
Процедура ПроверитьКоробку(Команда)
	
	Ошибки = "";
	Если НЕ ЗначениеЗаполнено(Объект.Сканировщик) Тогда
		Ошибки = "Не заполнен <Сканировщик> !!!";			
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НоменклатураОсновная) Тогда
		Ошибки = "Не заполнена <Номенклатура Основная> !!!";
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.КодАгрегации) Тогда
		Ошибки = "Не заполнен <Код Агрегации> !!!";
	КонецЕсли;   
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ПоказатьПредупреждение(, Ошибки);
		Возврат;
	КонецЕсли;
	
	Если МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда
	
		ПроверитьКоробкуНаСервере();
	
		Объект.ОкончаниеСканирования = ТекущаяДатаСеанса();
	
		Для Каждого Стр ИЗ Объект.СоставБригады Цикл
			Стр.ДатаОкончания = Объект.ОкончаниеСканирования;	
		КонецЦикла;
	
		УправлениеВидимостью();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКоробкуНаСервере()
	
	тзТовары = Объект.Товары.Выгрузить();
	тзШтрихкодыУпаковок = Объект.ШтрихкодыУпаковок.Выгрузить();
	
	МассивСообщений = Новый Массив;
	Если Объект.НеПолныйКороб Тогда
		МассивСообщений.Добавить("Сверка коробки без кода Агрегации (не полный короб)");
	Иначе
		МассивСообщений.Добавить("Сверка коробки " + Строка(Объект.КодАгрегации));
	КонецЕсли;
	
	Если Объект.КоличествоЗаводское = 0 Тогда
		МассивСообщений.Добавить("Количество заводское не может = 0!");
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////
	// Сравним Номенклатуру в ТЧ Товары
	////////////////////////////////////////////////////////////////////////////////////////
	
	МассивТовары = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(тзТовары.ВыгрузитьКолонку("Номенклатура"));
	
	Если МассивТовары.Количество() > 1 Тогда
		МассивСообщений.Добавить("Количество строк в товарах > 1. В заводских коробках такого быть не должно!");
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если МассивТовары.Найти(Объект.НоменклатураОсновная) = Неопределено Тогда
		МассивСообщений.Добавить("Номенклатура товаров не совпадает с основной Номенклатурой!");
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////
	// Сравним Номенклатуру в ТЧ Штрихкоды Упаковок
	////////////////////////////////////////////////////////////////////////////////////////
	
	МассивУпаковка = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(тзШтрихкодыУпаковок.ВыгрузитьКолонку("Номенклатура"));
	
	Если МассивУпаковка.Количество() = 0 Тогда
		МассивСообщений.Добавить("Не отсканированы Штрихкоды Упаковки!!!");
		МассивСообщений.Добавить("Дальнейшая проверка произведена не будет!");
		Объект.ЕстьОшибки = Истина;
		ТекстСообщение = СтрСоединить(МассивСообщений, Символы.ПС);
		Сообщить(ТекстСообщение);
		Возврат Объект.ЕстьОшибки;
	КонецЕсли;
	
	Если МассивУпаковка.Найти(Объект.НоменклатураОсновная) = Неопределено Тогда
		МассивСообщений.Добавить("Номенклатура штрихкодов Упаковки не совпадает с основной Номенклатурой!");
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого СтрТЗ Из тзШтрихкодыУпаковок Цикл
		Если СтрТЗ.Номенклатура <> Объект.НоменклатураОсновная Тогда
			МассивСообщений.Добавить(СтрШаблон("Обнаружен код <Честный Знак> %1 от другой Номенклатуры %2", СтрТЗ.ТекстQR, СтрТЗ.Номенклатура));
			Объект.ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	// Устанавливаем Характеристики
	/////////////////////////////////////////////////////////////////////////////////////////
	
	Объект.КоличествоНеверныхШтучныхКодов = Документы.ПроверкаПоставкиМаркированногоТовара.КоличествоНеверныхШтучныхКодов(
		Объект.КодАгрегации, тзШтрихкодыУпаковок);
	
	Если Объект.КоличествоНеверныхШтучныхКодов <> 0 Тогда
		МассивСообщений.Добавить(СтрШаблон("Количество неверных штучных кодов - %1", Объект.КоличествоНеверныхШтучныхКодов));
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Объект.КоличествоНеправильногоСодержимогоКоробки = Документы.ПроверкаПоставкиМаркированногоТовара.КоличествоНеправильногоСодержимогоКоробки(
		Объект.НоменклатураОсновная, тзШтрихкодыУпаковок);
	
	Если Объект.КоличествоНеправильногоСодержимогоКоробки <> 0 Тогда
		МассивСообщений.Добавить(СтрШаблон("Количество неправильного содержимого коробки - %1", Объект.КоличествоНеправильногоСодержимогоКоробки));
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Объект.ОтклонениеОтЗаводскогоКоличества = Документы.ПроверкаПоставкиМаркированногоТовара.ОтклонениеОтЗаводскогоКоличества(
		Объект.КоличествоЗаводское, тзШтрихкодыУпаковок);
	
	Если Объект.ОтклонениеОтЗаводскогоКоличества <> 0 Тогда
		МассивСообщений.Добавить(СтрШаблон("Отклонение от заводского количества - %1", Объект.ОтклонениеОтЗаводскогоКоличества));
		Объект.ЕстьОшибки = Истина;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	
	Если МассивСообщений.Количество() = 1 Тогда
		МассивСообщений.Добавить("Ошибок нет!");
		Объект.ЕстьОшибки = Ложь;
	КонецЕсли;
	
	ТекстСообщение = СтрСоединить(МассивСообщений, Символы.ПС);
	Сообщить(ТекстСообщение);
	
	Возврат Объект.ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура СброситьРежимСканирования(Команда)
	
	СброситьРежимСканированияНаСервере();
	
	ПереключитьРежимСканирования ("");
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура СброситьРежимСканированияНаСервере()
	
	Объект.Товары.Очистить();
	Объект.ШтрихкодыУпаковок.Очистить();
	Объект.СоставБригады.Очистить();
	
	Объект.КодАгрегации = Неопределено;
	Объект.НоменклатураОсновная = Неопределено;
	Объект.Сканировщик = Неопределено;
	
	Объект.КоличествоЗаводское = 0;
	Объект.КоличествоНеверныхШтучныхКодов = 0;
	Объект.КоличествоНеправильногоСодержимогоКоробки = 0;
	
	Объект.ЕстьОшибки = Ложь;
	Объект.НеПолныйКороб = Ложь;
	
	Объект.НачалоСканирования = ТекущаяДатаСеанса();
	Объект.ОкончаниеСканирования = ПустаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимСканирования(РежимСканирования)
	
	Если РежимСканирования = "ОбычныйШК" Тогда
		ОжидаемоеДействие = "Отсканирован обычный Штрих-код товара";          // ЭтаФорма.ОжидаемоеДействие
	ИначеЕсли РежимСканирования = "КоробЧЗ" тогда
		ОжидаемоеДействие = "Отсканирован Штрих-код коробки";
	ИначеЕсли РежимСканирования = "ШтукаЧЗ" тогда
		ОжидаемоеДействие = "Отсканирован Код маркировки штуки <Честный Знак>";
	ИначеЕсли РежимСканирования = "ФизЛица" Тогда
		ОжидаемоеДействие = "Отсканирован Штрих-код Сотрудника";
	Иначе
		ОжидаемоеДействие = "Ожидаю...";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСоответствиеРежимаСканирования (текШтрихКод)
	
	ТипШтрихКода = ЗаполнениеДокументов.ОпределитьТипШтрихКода(текШтрихКод);
	
	Если ТипШтрихКода = "EAN13" И Лев(текШтрихКод, 3) = "777" Тогда
		Возврат "ФизЛица";
	КонецЕсли;
	
	Если ТипШтрихКода = "ITF14" ИЛИ ТипШтрихКода = "EAN13" Тогда
		Возврат "ОбычныйШК";
	КонецЕсли;
	
	Если ТипШтрихКода = "CODE128" ИЛИ ТипШтрихКода = "CODE39" Тогда
		Возврат "КоробЧЗ";
	КонецЕсли;
	
	Если ТипШтрихКода = "DataMatrix" Тогда
		Возврат "ШтукаЧЗ";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

&НаКлиенте
Процедура УстановитьФокус()
	ТекущийЭлемент = Элементы.ИмитацияСканирования;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиФормы

&НаКлиенте
Процедура СканировщикОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Объект.Сканировщик = ВыбранноеЗначение;
		
		НайденныеСтроки = Объект.СоставБригады.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.СоставБригады.Добавить();
			НоваяСтрока.Сотрудник = ВыбранноеЗначение;
			Если ЗначениеЗаполнено(Объект.НачалоСканирования) Тогда
				НоваяСтрока.ДатаНачала = Объект.НачалоСканирования;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБригадыСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		НайденныеСтроки = Объект.СоставБригады.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТекущиеДанные = Элементы.СоставБригады.ТекущиеДанные;
			ТекущиеДанные.Сотрудник = ВыбранноеЗначение;
			ТекущиеДанные.ДатаНачала = Объект.НачалоСканирования;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Сканировщик) Тогда
			Объект.Сканировщик = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодАгрегацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Объект.КодАгрегации = ВыбранноеЗначение;
		//++Данилова Е.В. 05.05.2026 SNL-219 
		ЛистПоКоду = Документы.ПроверкаПоставкиМаркированногоТовара.НайтиЛистПоКодуАгрегации(Объект.КодАгрегации);
		Если ЗначениеЗаполнено(ЛистПоКоду) Тогда
			
			Объект.ДокОснование = ЛистПоКоду; 	 
			
		КонецЕсли;
		//--Данилова Е.В. 05.05.2026
		
		Объект.НоменклатураОсновная = ЗначениеРеквизитаОбъекта(Объект.КодАгрегации, "Владелец");
		
		Объект.КоличествоЗаводское = ЗначениеРеквизитаОбъекта(Объект.КодАгрегации, "Количество");
		
		СтруктураВозврата = Документы.ПроверкаПоставкиМаркированногоТовара.НайтиКоличествоЗаводское(Объект.КодАгрегации);
		
		Если Объект.КоличествоЗаводское = 0 Тогда
			Объект.КоличествоЗаводское = СтруктураВозврата.КоличествоЗаводское;
		КонецЕсли;
		
		Для Каждого СтруктураСтроки ИЗ СтруктураВозврата.МассивНоменклатуры Цикл
		
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтруктураСтроки.Номенклатура));
		
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), СтруктураСтроки);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Объект.ДокОснование = ВыбранноеЗначение;     
		//Кухарь А.Ю.  12.05.2026 начало
		// SNL-219                       
		ДокОснованиеПриИзменении(Неопределено);
		//Кухарь А.Ю.  12.05.2026 конец
		
		
		ОчиститьРеквизитыФормы();
		
		ЗаполнитьНаСервере(ВыбранноеЗначение);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ВыбранноеЗначение)
	
	Значение = РеквизитФормыВЗначение("Объект");
	Значение.Заполнить(ВыбранноеЗначение);
	ЗначениеВРеквизитФормы(Значение,"Объект"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыФормы()
	
	Если ЗначениеЗаполнено(Объект.КодАгрегации) Тогда
		Объект.КодАгрегации = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НоменклатураОсновная) Тогда
		Объект.НоменклатураОсновная = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Сканировщик) Тогда
		Объект.Сканировщик = Неопределено;
	КонецЕсли;
	
	Если Объект.СоставБригады.Количество() > 0 Тогда
		Объект.СоставБригады.Очистить();
	КонецЕсли;
	
	Объект.ЕстьОшибки = Ложь;
	Объект.НеПолныйКороб = Ложь;
	
	Объект.КоличествоЗаводское = 0;
	Объект.КоличествоЛинейныхШК = 0;
	Объект.КоличествоНеверныхШтучныхКодов = 0;
	Объект.КоличествоНеправильногоСодержимогоКоробки = 0;
	Объект.ОтклонениеОтЗаводскогоКоличества = 0;
	
	Объект.НачалоСканирования = ТекущаяДатаСеанса();
	Объект.ОкончаниеСканирования = ПустаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокОснованиеПриИзменении(Элемент)
	//Кухарь А.Ю.  12.05.2026 начало
	// SNL-219                       
	если ЗначениеЗаполнено(Объект.ДокОснование)  тогда
		Накладная = ПолучитьРеквизитШапки(Объект.ДокОснование,"ДокОснование","Документ");
		если ТипЗнч(Накладная) = Тип("ДокументСсылка.ПриходнаяНакладная") тогда
			объект.Накладная = Накладная;
		иначе      
			объект.Накладная = документы.ПриходнаяНакладная.ПустаяСсылка();
		КонецЕсли;
	иначе
		объект.Накладная = документы.ПриходнаяНакладная.ПустаяСсылка();
	КонецЕсли;
	//Кухарь А.Ю.  12.05.2026 конец
КонецПроцедуры

#КонецОбласти
